# config.py
BOT_TOKEN = "8824533487:AAGBcXmQki4ukiPZ7cLzdngr2zSBudCdRec"
# ID администраторов (можно получить у @userinfobot)
ADMIN_IDS = [6784775371, 379157019, 977589550, 8260958694]
OWNER_ID = 379157019               # ID владельца (куда слать логи)

# Каналы: ID -> Название
# ID канала всегда начинается с -100
CHANNELS = {
    -1003955086196: {"name": "78 английский"},
    -1003946425195: {"name": "78 химия"},
    -1003867547991: {"name": "78 история"},
    -1003947461686: {"name": "78 биология"},
    -1003743457239: {"name": "78 география"},
    -1003951248965: {"name": "78 обществознание"},
    -1003907827748: {"name": "78 информатика"},
    -1003828980533: {"name": "78 Физика"},
    
    -1004379794978: {"name": "ВСЕ ПРЕДМЕТЫ РФ"},

    -1004271720550: {"name": "РФ Английский"},
    -1004382664977: {"name": "РФ История"},
    -1004393869522: {"name": "РФ Русский"},
    -1004368058619: {"name": "РФ География"},
    -1004418838766: {"name": "РФ Физика"},
    -1004458201961: {"name": "РФ Химия"},
    -1003904823616: {"name": "РФ Биология"},
    -1004408138379: {"name": "РФ Математика"},
    -1004455559972: {"name": "РФ Информатика"},
    -1004330192746: {"name": "РФ Обществознание"}
}
