# config.py
BOT_TOKEN = "8824533487:AAGBcXmQki4ukiPZ7cLzdngr2zSBudCdRec"
# ID администраторов (можно получить у @userinfobot)
ADMIN_IDS = [6784775371, 379157019, 977589550, 8260958694]
OWNER_ID = 379157019               # ID владельца (куда слать логи)

# Каналы: ID -> Название
# ID канала всегда начинается с -100
CHANNELS = {
    -1003948657550: {"name": "77 химия"},
    -1003732839930: {"name": "77 Обществознание"},
    -1003955086196: {"name": "78 английский"},
    -1003946425195: {"name": "78 химия"},
    -1003867547991: {"name": "78 история"},
    -1004296599301: {"name": "78 литература"},
    -1003947461686: {"name": "78 биология"},
    -1003743457239: {"name": "78 география"},
    -1003951248965: {"name": "78 обществознание"},
    -1003907827748: {"name": "78 информатика"},
    -1003811822461: {"name": "77 Информатика"},
    -1003828980533: {"name": "78 Физика"},
}
